---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindGlobalParam
source: html/26a580bb-9d70-75e8-8cf3-3c46882e797c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindGlobalParam Property

Can't change connection type to Feed Through Lugs because Feed Through Lugs is not enabled. Enable Feed Through Lugs by enabling the global parameter that Feed Through Lugs is mapping. Click Manage tab -> Settings panel -> Global Parameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId FeedThroughLugsIsNotEnabledAndBindGlobalParam { get; }
```